# 3. 주식 거래 시 가장 빨리 수익을 내는 날
# 어떤 주식의 날짜별 주가를 알려주는 배열 price가 주어집니다.
# 이때, 각 날짜에 주식을 샀을 경우 팔아서 차익을 보려고 할 때 기다려야 하는 최소 일수를 구하시오.
# 만약 어떤 날 주식을 샀을 때 그 이후에 팔아서 차익을 볼 수 없는 경우, -1을 반환합니다.
#
# 예시) price = [4, 1, 4, 7, 6] 이 주어졌다고 합시다.
# 0일에 4원으로 구입하면, 3일에 7원으로 팔면 가장 일찍 차익을 봅니다. 즉 3일 기다립니다.
# 1일에 1원으로 구입하면, 2일에 4원으로 팔면 가장 일찍 차익을 봅니다. 즉 1일 기다립니다.
# 2일에 4원으로 구입하면, 3일에 7원으로 팔면 가장 일찍 차익을 봅니다. 즉 1일 기다립니다.
# 3일에 7원으로 구입하면, 이 이후 언제 팔든 차익을 볼 수 없습니다. 즉 -1일 기다립니다.
# 4일에 6원으로 구입하면, 이 이후 언제 팔든 차익을 볼 수 없습니다. 즉 -1일 기다립니다.
# 따라서 답은 [3, 1, 1, -1, -1] 입니다.
# (Nested for 쓰면 효율성 검사 통과 못 함)


def solution(price):
    # pre

    # init

    # struct

    # main

    # post

    ans = []
    return ans


eg1 = [4, 1, 4, 7, 6]
ans1 = solution(eg1)
print(ans1)
